Revit 2024 API
CurveLoop Constructor
 Constructs a new empty curve loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public CurveLoop()
Visual Basic
Public Sub New
Visual C++
public:
CurveLoop()
See Also
CurveLoop Class
Autodesk.Revit.DB Namespace